---
kind: property
id: P:Autodesk.Revit.DB.FamilySizeTableManager.NumberOfSizeTables
source: html/db83ab76-8e76-1f10-9789-8ea1a1879f0a.htm
---
# Autodesk.Revit.DB.FamilySizeTableManager.NumberOfSizeTables Property

The number of FamilySizeTables in a family.

## Syntax (C#)
```csharp
public int NumberOfSizeTables { get; }
```